[
  {
    "title": "Phase 1",
    "period": "2Q 2022",
    "todo": "Develop community on Discord and Twitter. Website/Discord Launch Party for TwinZNFT.com. Whitepaper and Roadmap released on Website and through Discord. Mint Details with price and dates announced. Schedule drop on nftcalendar.io and other announcement platforms. Whitelist Challenges provided to community members. Community contest and games for exclusive prizes. Release of OT Mint Pass Sales"
  },
  {
    "title": "Phase 2",
    "period": "3Q 2022",
    "todo": "Release of Whitelist Pre-Sale. Website Minting open to General Public. TwinZ will be released and minted within their Society. Each Society will have a release apart to give more people a chance to mint and to support the floor price. Establish Listings on OpenSea and LooksRare. Merchandise Drops. Once 100% of TwinZ have been minted Birth Certificates will be released for each NFT identifying the family it belongs to. Information and hints will be slowly released on our Website and Discord. Staking Pool for TwinZ Holders are open for prizes and rewards."
  },
  {
    "title": "Phase 3",
    "period": "4Q 2022",
    "todo": "Grow and Reward the Community. Airdrop of TwinZ Token. Creation of Futago Marketplace for community members to spend the TwinZ token such as NFT Collaboration Giveaways, Whitelist Collaboration Opportunities, Merchandise, TwinZ 3D Avatars for Metaverse, along with weapons, tools, and accessories for future gaming. Continued Marketing through listing on RarityTools, Rarity Sniper, NFT-Stats, The NFT Score and other platforms. Get verified on OpenSea and LooksRare. Discord will be further developed to include the society families each TwinZ NFT belongs to. Challenges and games between the society families will be released for prizes."
  },
  {
    "title": "Phase 4",
    "period": "1Q 2023",
    "todo": "Your TwinZ NFT will be a working Avatar in the metaverse and will grant you free access into our TwinZ Club. Exclusive 3D Avatars of your TwinZ NFT will be developed and offered to the holder. TwinZ Club will be a private club where you can share ideas and gain insight to future developments. Honorary Guest will receive special invites for exclusive events. TwinZ will be a launchpad to future NFT projects and artist with our members receiving early access prior to launch.  Custom Clothes and Accessories will be offered to enhance your Metaverse Experience."
  },
  {
    "title": "Phase 5",
    "period": "2Q 2023",
    "todo": "Exclusive Events and Parties to build Community through diversity as art and culture fuse to create magic. The lines between the physical and digital worlds are blurring and the rules are being re-written. Contribute to the Manga as storylines are developed through comics and video."
  },
  {
    "title": "Phase 6",
    "period": "3Q 2023",
    "todo": "Launch an immersive gaming platform in the Metaverse that features both PvP battles and PvE missions. TwinZ will offer a range of earning mechanisms and rewards including staking, trading, and P2E. The diverse TwinZ societies will battle for ultimate supremacy or build strategic alignments for survival."
  }
]
